biddr_api/biddr/app/controllers/api/v1/auctions_controller.rb

        def index
            @auctions = Auction.all
---
SELECT "auctions".* FROM "auctions"

        def show
            @auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

          def find_auction
            @auction||=Auction.find params[:id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]