biddr_api/biddr/app/controllers/v1/auctions_controller.rb

        def index
            @auctions = Auction.all
---
SELECT "auctions".* FROM "auctions"